/*
Задача 1. Проверить два введенных числа - квадрат ли это?
*/
using System;

System.Console.WriteLine("Ведите два числа: ");

int userNumber1 = System.Convert.ToInt32(System.Console.ReadLine());
int userNumber2 = System.Convert.ToInt32(Console.ReadLine());

if (userNumber1 / userNumber2 == user_number_2)
{
    System.Console.WriteLine($"Введеное первое число являеться квдратом второго");
}
else
{
    System.Console.WriteLine($"Введеное первое число не являеться квадратом второго");
}
