/*
18 Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
*/
using System;
Console.Clear();

System.Console.WriteLine("Ddtlbnt номер четверти 1,2,3 или 4:");
int quarter = System.Convert.To Int32(Console.ReadLine();
if (quarter == 1) System.Console.WriteLine("Чтобы точка была в первой четверти необходимо точку X должна быть положительной и точка Y должна быть положительной ");